// ILLIT
// for (let i = 0; i <= 5; i +=1) {
//     console.log(i)
    
// }

// // for (let index = 0; index < array; index++) {
// //   
    
// // }

// for (let nr = 0; nr <= 10; nr +=1) {
//     console.log(nr);
// }


/*
 * Напиши скрипт який порахує суму всіх парних чисел,
 * які входять в діапазон чисел в змінних від min до max.
 * Наприклад, якщо min=0 и max=5, то діапазон 0-5, і в 
 * ньому 2 парних числа - 2 та 4, їх сума 6.
 */
// let min = 0;
// let max = 12;
// let total = 0;
// for (let i = min; i <= max; i += 1) {
//     console.log(i);
//     if (i % 2 === 0) {
//         total += i
//     }
// }
// console.log(` Zagalna summa ${total}` );

//mrkloamxx


// 1. Вивести в консоль числа від 1 до 5 всіма циклами
// for (let i = 0; i <= 5; i+=  1) {
//     console.log(i);
    
// }


// 4. Написати скрипт який буде перевіряти середній бал успішності учня.
// Прервати роботу циклу, коли середній бал буде меньше 7.
// let TotalMark = 7
// for (let i = 10; i >= TotalMark || i <= TotalMark; i -= 1) {
//     if (i < TotalMark) {
//         console.log(`Your avarage mark is less then 6`);
//         break
//     }
//     console.log(i);
// }

// 5. Виведіть в консоль всі непарні числа за допомогою циклу for

// let min = 0;
// let max = 10000;
// let total = 0;
// for (let i = min; i <= max; i += 1) {
//     console.log(i);
//     if (i % 2 === 1) {
//         total += i
//     }
// }
// console.log(` Zagalna summa ${total}` );
// 6. Напиши цикл, який пропонує в prompt ввести число, більше 100. Якщо відвідувач ввів інше число – попросити ввести ще раз и т.д.
// Цикл повинен питати число поки відвідувач не введе число, більше 100, або не натисне кнопку Відміна (ESC).
let askNum = prompt("Please write the number that bigger than 100")
while (askNum < 100) {
    console.log('Its less than 100');
    askNum = prompt("Please write the number that bigger than 100")
    
}
console.log(askNum);
/*
* ЗАВДАННЯ 6
* Напиши скрипт який просить відвідувача ввести число в prompt до тих пір, поки відвідувач не натисне 
* Cancel і кожен раз додає введене значення до загальної суми.
* При завантаженні сторінки користувачеві пропонується в prompt ввести число. Введення додається до 
* значення змінної total.
* Операція введення числа триває до тих пір, поки користувач не натисне кнопку Cancel в prompt.
* Після того як користувач припинив введення натиснувши кнопку Cancel, показати alert з рядком 
* 'Загальна сума чисел дорівнює [сума]'.
* 🔔 Робити перевірку того, що користувач ввів саме число, а не довільний набір символів, не потрібно. 
* Якщо хочеш, в разі некоректного введення, показуй alert з текстом 'Було написано не число, спробуйте 
* ще раз', при цьому результат prompt плюсувати до загальної суми не потрібно, після чого знову 
* користувачеві пропонується ввести число в prompt.
* */

// let input;
// let total;
